test/artillery/Artillery-test-users-user_id-tasks.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://mchfd7t6l4.execute-api.us-west-2.amazonaws.com"
  phases:
      phases:
      - name: Warm Up
        duration: 60
        arrivalRate: 2
      - name: Ramp up
        duration: 120
        arrivalRate: 5
        rampTo: 60
     
  - flow:
    - get:
        url: "/users/1/1""