test/artillery/artillery-test-users-id-tasks-id-api.yaml
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
    - duration: 10
      arrivalRate: 4
      name: Warm up 1 request per second

scenarios:
  - name: "Test flow"
    flow:
      - get:
          url: "/users/1/tasks/1"
          expect:
            - statusCode: 200